In [5]:
import pandas as pd
import pyodbc

In [6]:
conn_str = 'DRIVER={ODBC Driver 17 for SQL Server};\
            SERVER=MSI\DUCNAM;\
            DATABASE=MyDatabase;\
            UID=dn;\
            PWD=123456'


conn = pyodbc.connect(conn_str)
query = "SELECT * FROM Student"
df = pd.read_sql(query, conn)

c:\Users\FPT SHOP\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [7]:
# Xóa dòng đầu tiên trong DataFrame
df = df.iloc[1:]
df

   ID    Name  Age
1   2    Jane   22
2   3    Mike   21
3   4   Sarah   19
4   5   David   23
5   6   Emily   20
6   7  Daniel   22
7   8  Olivia   21
8   9   Jacob   19
9  10  Sophia   23

In [8]:
df.to_sql('Student', conn, if_exists='replace', index=False)

c:\Users\FPT SHOP\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': ('42S02', "[42S02] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Invalid object name 'sqlite_master'. (208) (SQLExecDirectW); [42S02] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Statement(s) could not be prepared. (8180)")

In [ ]:
df

   ID    Name  Age
1   2    Jane   22
2   3    Mike   21
3   4   Sarah   19
4   5   David   23
5   6   Emily   20
6   7  Daniel   22
7   8  Olivia   21
8   9   Jacob   19
9  10  Sophia   23

In [ ]:
conn.close()